###################################################################

# Created by write_sdc on Tue Apr 28 13:14:09 2026

###################################################################
set sdc_version 2.2

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current uA
create_clock [get_ports pixel_clk]  -period 6.7  -waveform {0 3.35}
set_clock_uncertainty 0.1  [get_clocks pixel_clk]
create_clock [get_ports sys_clk]  -period 2.5  -waveform {0 1.25}
set_clock_uncertainty 0.1  [get_clocks sys_clk]
create_clock [get_ports byte_clk]  -period 10  -waveform {0 5}
set_clock_uncertainty 0.1  [get_clocks byte_clk]
create_clock [get_ports ppi_tx_ByteClkHS]  -period 10  -waveform {0 5}
set_clock_uncertainty 0.1  [get_clocks ppi_tx_ByteClkHS]
create_clock [get_ports pclk]  -period 20  -waveform {0 10}
set_clock_uncertainty 0.1  [get_clocks pclk]
group_path -weight 5  -name SYS_CLK_CRITICAL  -to [get_clocks sys_clk]
set_input_delay -clock pixel_clk  -max 1.34  [get_ports {tx_axis_tdata[31]}]
set_input_delay -clock pixel_clk  -max 1.34  [get_ports {tx_axis_tdata[30]}]
set_input_delay -clock pixel_clk  -max 1.34  [get_ports {tx_axis_tdata[29]}]
set_input_delay -clock pixel_clk  -max 1.34  [get_ports {tx_axis_tdata[28]}]
set_input_delay -clock pixel_clk  -max 1.34  [get_ports {tx_axis_tdata[27]}]
set_input_delay -clock pixel_clk  -max 1.34  [get_ports {tx_axis_tdata[26]}]
set_input_delay -clock pixel_clk  -max 1.34  [get_ports {tx_axis_tdata[25]}]
set_input_delay -clock pixel_clk  -max 1.34  [get_ports {tx_axis_tdata[24]}]
set_input_delay -clock pixel_clk  -max 1.34  [get_ports {tx_axis_tdata[23]}]
set_input_delay -clock pixel_clk  -max 1.34  [get_ports {tx_axis_tdata[22]}]
set_input_delay -clock pixel_clk  -max 1.34  [get_ports {tx_axis_tdata[21]}]
set_input_delay -clock pixel_clk  -max 1.34  [get_ports {tx_axis_tdata[20]}]
set_input_delay -clock pixel_clk  -max 1.34  [get_ports {tx_axis_tdata[19]}]
set_input_delay -clock pixel_clk  -max 1.34  [get_ports {tx_axis_tdata[18]}]
set_input_delay -clock pixel_clk  -max 1.34  [get_ports {tx_axis_tdata[17]}]
set_input_delay -clock pixel_clk  -max 1.34  [get_ports {tx_axis_tdata[16]}]
set_input_delay -clock pixel_clk  -max 1.34  [get_ports {tx_axis_tdata[15]}]
set_input_delay -clock pixel_clk  -max 1.34  [get_ports {tx_axis_tdata[14]}]
set_input_delay -clock pixel_clk  -max 1.34  [get_ports {tx_axis_tdata[13]}]
set_input_delay -clock pixel_clk  -max 1.34  [get_ports {tx_axis_tdata[12]}]
set_input_delay -clock pixel_clk  -max 1.34  [get_ports {tx_axis_tdata[11]}]
set_input_delay -clock pixel_clk  -max 1.34  [get_ports {tx_axis_tdata[10]}]
set_input_delay -clock pixel_clk  -max 1.34  [get_ports {tx_axis_tdata[9]}]
set_input_delay -clock pixel_clk  -max 1.34  [get_ports {tx_axis_tdata[8]}]
set_input_delay -clock pixel_clk  -max 1.34  [get_ports {tx_axis_tdata[7]}]
set_input_delay -clock pixel_clk  -max 1.34  [get_ports {tx_axis_tdata[6]}]
set_input_delay -clock pixel_clk  -max 1.34  [get_ports {tx_axis_tdata[5]}]
set_input_delay -clock pixel_clk  -max 1.34  [get_ports {tx_axis_tdata[4]}]
set_input_delay -clock pixel_clk  -max 1.34  [get_ports {tx_axis_tdata[3]}]
set_input_delay -clock pixel_clk  -max 1.34  [get_ports {tx_axis_tdata[2]}]
set_input_delay -clock pixel_clk  -max 1.34  [get_ports {tx_axis_tdata[1]}]
set_input_delay -clock pixel_clk  -max 1.34  [get_ports {tx_axis_tdata[0]}]
set_input_delay -clock pixel_clk  -max 1.34  [get_ports tx_axis_tvalid]
set_input_delay -clock pixel_clk  -max 1.34  [get_ports tx_axis_tuser]
set_input_delay -clock pixel_clk  -max 1.34  [get_ports tx_axis_tlast]
set_input_delay -clock pclk  -max 4  [get_ports {tx_apb_paddr[31]}]
set_input_delay -clock pclk  -max 4  [get_ports {tx_apb_paddr[30]}]
set_input_delay -clock pclk  -max 4  [get_ports {tx_apb_paddr[29]}]
set_input_delay -clock pclk  -max 4  [get_ports {tx_apb_paddr[28]}]
set_input_delay -clock pclk  -max 4  [get_ports {tx_apb_paddr[27]}]
set_input_delay -clock pclk  -max 4  [get_ports {tx_apb_paddr[26]}]
set_input_delay -clock pclk  -max 4  [get_ports {tx_apb_paddr[25]}]
set_input_delay -clock pclk  -max 4  [get_ports {tx_apb_paddr[24]}]
set_input_delay -clock pclk  -max 4  [get_ports {tx_apb_paddr[23]}]
set_input_delay -clock pclk  -max 4  [get_ports {tx_apb_paddr[22]}]
set_input_delay -clock pclk  -max 4  [get_ports {tx_apb_paddr[21]}]
set_input_delay -clock pclk  -max 4  [get_ports {tx_apb_paddr[20]}]
set_input_delay -clock pclk  -max 4  [get_ports {tx_apb_paddr[19]}]
set_input_delay -clock pclk  -max 4  [get_ports {tx_apb_paddr[18]}]
set_input_delay -clock pclk  -max 4  [get_ports {tx_apb_paddr[17]}]
set_input_delay -clock pclk  -max 4  [get_ports {tx_apb_paddr[16]}]
set_input_delay -clock pclk  -max 4  [get_ports {tx_apb_paddr[15]}]
set_input_delay -clock pclk  -max 4  [get_ports {tx_apb_paddr[14]}]
set_input_delay -clock pclk  -max 4  [get_ports {tx_apb_paddr[13]}]
set_input_delay -clock pclk  -max 4  [get_ports {tx_apb_paddr[12]}]
set_input_delay -clock pclk  -max 4  [get_ports {tx_apb_paddr[11]}]
set_input_delay -clock pclk  -max 4  [get_ports {tx_apb_paddr[10]}]
set_input_delay -clock pclk  -max 4  [get_ports {tx_apb_paddr[9]}]
set_input_delay -clock pclk  -max 4  [get_ports {tx_apb_paddr[8]}]
set_input_delay -clock pclk  -max 4  [get_ports {tx_apb_paddr[7]}]
set_input_delay -clock pclk  -max 4  [get_ports {tx_apb_paddr[6]}]
set_input_delay -clock pclk  -max 4  [get_ports {tx_apb_paddr[5]}]
set_input_delay -clock pclk  -max 4  [get_ports {tx_apb_paddr[4]}]
set_input_delay -clock pclk  -max 4  [get_ports {tx_apb_paddr[3]}]
set_input_delay -clock pclk  -max 4  [get_ports {tx_apb_paddr[2]}]
set_input_delay -clock pclk  -max 4  [get_ports {tx_apb_paddr[1]}]
set_input_delay -clock pclk  -max 4  [get_ports {tx_apb_paddr[0]}]
set_input_delay -clock pclk  -max 4  [get_ports tx_apb_psel]
set_input_delay -clock pclk  -max 4  [get_ports tx_apb_penable]
set_input_delay -clock pclk  -max 4  [get_ports tx_apb_pwrite]
set_input_delay -clock pclk  -max 4  [get_ports {tx_apb_pwdata[31]}]
set_input_delay -clock pclk  -max 4  [get_ports {tx_apb_pwdata[30]}]
set_input_delay -clock pclk  -max 4  [get_ports {tx_apb_pwdata[29]}]
set_input_delay -clock pclk  -max 4  [get_ports {tx_apb_pwdata[28]}]
set_input_delay -clock pclk  -max 4  [get_ports {tx_apb_pwdata[27]}]
set_input_delay -clock pclk  -max 4  [get_ports {tx_apb_pwdata[26]}]
set_input_delay -clock pclk  -max 4  [get_ports {tx_apb_pwdata[25]}]
set_input_delay -clock pclk  -max 4  [get_ports {tx_apb_pwdata[24]}]
set_input_delay -clock pclk  -max 4  [get_ports {tx_apb_pwdata[23]}]
set_input_delay -clock pclk  -max 4  [get_ports {tx_apb_pwdata[22]}]
set_input_delay -clock pclk  -max 4  [get_ports {tx_apb_pwdata[21]}]
set_input_delay -clock pclk  -max 4  [get_ports {tx_apb_pwdata[20]}]
set_input_delay -clock pclk  -max 4  [get_ports {tx_apb_pwdata[19]}]
set_input_delay -clock pclk  -max 4  [get_ports {tx_apb_pwdata[18]}]
set_input_delay -clock pclk  -max 4  [get_ports {tx_apb_pwdata[17]}]
set_input_delay -clock pclk  -max 4  [get_ports {tx_apb_pwdata[16]}]
set_input_delay -clock pclk  -max 4  [get_ports {tx_apb_pwdata[15]}]
set_input_delay -clock pclk  -max 4  [get_ports {tx_apb_pwdata[14]}]
set_input_delay -clock pclk  -max 4  [get_ports {tx_apb_pwdata[13]}]
set_input_delay -clock pclk  -max 4  [get_ports {tx_apb_pwdata[12]}]
set_input_delay -clock pclk  -max 4  [get_ports {tx_apb_pwdata[11]}]
set_input_delay -clock pclk  -max 4  [get_ports {tx_apb_pwdata[10]}]
set_input_delay -clock pclk  -max 4  [get_ports {tx_apb_pwdata[9]}]
set_input_delay -clock pclk  -max 4  [get_ports {tx_apb_pwdata[8]}]
set_input_delay -clock pclk  -max 4  [get_ports {tx_apb_pwdata[7]}]
set_input_delay -clock pclk  -max 4  [get_ports {tx_apb_pwdata[6]}]
set_input_delay -clock pclk  -max 4  [get_ports {tx_apb_pwdata[5]}]
set_input_delay -clock pclk  -max 4  [get_ports {tx_apb_pwdata[4]}]
set_input_delay -clock pclk  -max 4  [get_ports {tx_apb_pwdata[3]}]
set_input_delay -clock pclk  -max 4  [get_ports {tx_apb_pwdata[2]}]
set_input_delay -clock pclk  -max 4  [get_ports {tx_apb_pwdata[1]}]
set_input_delay -clock pclk  -max 4  [get_ports {tx_apb_pwdata[0]}]
set_input_delay -clock byte_clk  -max 2  [get_ports i2c_scl]
set_input_delay -clock byte_clk  -max 2  [get_ports i2c_sda]
set_input_delay -clock ppi_tx_ByteClkHS  -max 2  [get_ports {ppi_tx_ReadyHS[3]}]
set_input_delay -clock ppi_tx_ByteClkHS  -max 2  [get_ports {ppi_tx_ReadyHS[2]}]
set_input_delay -clock ppi_tx_ByteClkHS  -max 2  [get_ports {ppi_tx_ReadyHS[1]}]
set_input_delay -clock ppi_tx_ByteClkHS  -max 2  [get_ports {ppi_tx_ReadyHS[0]}]
set_input_delay -clock ppi_tx_ByteClkHS  -max 2  [get_ports ppi_tx_ClkReadyHS]
set_output_delay -clock pixel_clk  -max 1.34  [get_ports tx_axis_tready]
set_output_delay -clock pclk  -max 4  [get_ports {tx_apb_prdata[31]}]
set_output_delay -clock pclk  -max 4  [get_ports {tx_apb_prdata[30]}]
set_output_delay -clock pclk  -max 4  [get_ports {tx_apb_prdata[29]}]
set_output_delay -clock pclk  -max 4  [get_ports {tx_apb_prdata[28]}]
set_output_delay -clock pclk  -max 4  [get_ports {tx_apb_prdata[27]}]
set_output_delay -clock pclk  -max 4  [get_ports {tx_apb_prdata[26]}]
set_output_delay -clock pclk  -max 4  [get_ports {tx_apb_prdata[25]}]
set_output_delay -clock pclk  -max 4  [get_ports {tx_apb_prdata[24]}]
set_output_delay -clock pclk  -max 4  [get_ports {tx_apb_prdata[23]}]
set_output_delay -clock pclk  -max 4  [get_ports {tx_apb_prdata[22]}]
set_output_delay -clock pclk  -max 4  [get_ports {tx_apb_prdata[21]}]
set_output_delay -clock pclk  -max 4  [get_ports {tx_apb_prdata[20]}]
set_output_delay -clock pclk  -max 4  [get_ports {tx_apb_prdata[19]}]
set_output_delay -clock pclk  -max 4  [get_ports {tx_apb_prdata[18]}]
set_output_delay -clock pclk  -max 4  [get_ports {tx_apb_prdata[17]}]
set_output_delay -clock pclk  -max 4  [get_ports {tx_apb_prdata[16]}]
set_output_delay -clock pclk  -max 4  [get_ports {tx_apb_prdata[15]}]
set_output_delay -clock pclk  -max 4  [get_ports {tx_apb_prdata[14]}]
set_output_delay -clock pclk  -max 4  [get_ports {tx_apb_prdata[13]}]
set_output_delay -clock pclk  -max 4  [get_ports {tx_apb_prdata[12]}]
set_output_delay -clock pclk  -max 4  [get_ports {tx_apb_prdata[11]}]
set_output_delay -clock pclk  -max 4  [get_ports {tx_apb_prdata[10]}]
set_output_delay -clock pclk  -max 4  [get_ports {tx_apb_prdata[9]}]
set_output_delay -clock pclk  -max 4  [get_ports {tx_apb_prdata[8]}]
set_output_delay -clock pclk  -max 4  [get_ports {tx_apb_prdata[7]}]
set_output_delay -clock pclk  -max 4  [get_ports {tx_apb_prdata[6]}]
set_output_delay -clock pclk  -max 4  [get_ports {tx_apb_prdata[5]}]
set_output_delay -clock pclk  -max 4  [get_ports {tx_apb_prdata[4]}]
set_output_delay -clock pclk  -max 4  [get_ports {tx_apb_prdata[3]}]
set_output_delay -clock pclk  -max 4  [get_ports {tx_apb_prdata[2]}]
set_output_delay -clock pclk  -max 4  [get_ports {tx_apb_prdata[1]}]
set_output_delay -clock pclk  -max 4  [get_ports {tx_apb_prdata[0]}]
set_output_delay -clock pclk  -max 4  [get_ports tx_apb_pready]
set_output_delay -clock ppi_tx_ByteClkHS  -max 2  [get_ports {ppi_tx_DataHS_0[7]}]
set_output_delay -clock ppi_tx_ByteClkHS  -max 2  [get_ports {ppi_tx_DataHS_0[6]}]
set_output_delay -clock ppi_tx_ByteClkHS  -max 2  [get_ports {ppi_tx_DataHS_0[5]}]
set_output_delay -clock ppi_tx_ByteClkHS  -max 2  [get_ports {ppi_tx_DataHS_0[4]}]
set_output_delay -clock ppi_tx_ByteClkHS  -max 2  [get_ports {ppi_tx_DataHS_0[3]}]
set_output_delay -clock ppi_tx_ByteClkHS  -max 2  [get_ports {ppi_tx_DataHS_0[2]}]
set_output_delay -clock ppi_tx_ByteClkHS  -max 2  [get_ports {ppi_tx_DataHS_0[1]}]
set_output_delay -clock ppi_tx_ByteClkHS  -max 2  [get_ports {ppi_tx_DataHS_0[0]}]
set_output_delay -clock ppi_tx_ByteClkHS  -max 2  [get_ports {ppi_tx_DataHS_1[7]}]
set_output_delay -clock ppi_tx_ByteClkHS  -max 2  [get_ports {ppi_tx_DataHS_1[6]}]
set_output_delay -clock ppi_tx_ByteClkHS  -max 2  [get_ports {ppi_tx_DataHS_1[5]}]
set_output_delay -clock ppi_tx_ByteClkHS  -max 2  [get_ports {ppi_tx_DataHS_1[4]}]
set_output_delay -clock ppi_tx_ByteClkHS  -max 2  [get_ports {ppi_tx_DataHS_1[3]}]
set_output_delay -clock ppi_tx_ByteClkHS  -max 2  [get_ports {ppi_tx_DataHS_1[2]}]
set_output_delay -clock ppi_tx_ByteClkHS  -max 2  [get_ports {ppi_tx_DataHS_1[1]}]
set_output_delay -clock ppi_tx_ByteClkHS  -max 2  [get_ports {ppi_tx_DataHS_1[0]}]
set_output_delay -clock ppi_tx_ByteClkHS  -max 2  [get_ports {ppi_tx_DataHS_2[7]}]
set_output_delay -clock ppi_tx_ByteClkHS  -max 2  [get_ports {ppi_tx_DataHS_2[6]}]
set_output_delay -clock ppi_tx_ByteClkHS  -max 2  [get_ports {ppi_tx_DataHS_2[5]}]
set_output_delay -clock ppi_tx_ByteClkHS  -max 2  [get_ports {ppi_tx_DataHS_2[4]}]
set_output_delay -clock ppi_tx_ByteClkHS  -max 2  [get_ports {ppi_tx_DataHS_2[3]}]
set_output_delay -clock ppi_tx_ByteClkHS  -max 2  [get_ports {ppi_tx_DataHS_2[2]}]
set_output_delay -clock ppi_tx_ByteClkHS  -max 2  [get_ports {ppi_tx_DataHS_2[1]}]
set_output_delay -clock ppi_tx_ByteClkHS  -max 2  [get_ports {ppi_tx_DataHS_2[0]}]
set_output_delay -clock ppi_tx_ByteClkHS  -max 2  [get_ports {ppi_tx_DataHS_3[7]}]
set_output_delay -clock ppi_tx_ByteClkHS  -max 2  [get_ports {ppi_tx_DataHS_3[6]}]
set_output_delay -clock ppi_tx_ByteClkHS  -max 2  [get_ports {ppi_tx_DataHS_3[5]}]
set_output_delay -clock ppi_tx_ByteClkHS  -max 2  [get_ports {ppi_tx_DataHS_3[4]}]
set_output_delay -clock ppi_tx_ByteClkHS  -max 2  [get_ports {ppi_tx_DataHS_3[3]}]
set_output_delay -clock ppi_tx_ByteClkHS  -max 2  [get_ports {ppi_tx_DataHS_3[2]}]
set_output_delay -clock ppi_tx_ByteClkHS  -max 2  [get_ports {ppi_tx_DataHS_3[1]}]
set_output_delay -clock ppi_tx_ByteClkHS  -max 2  [get_ports {ppi_tx_DataHS_3[0]}]
set_output_delay -clock ppi_tx_ByteClkHS  -max 2  [get_ports ppi_tx_ValidHS_0]
set_output_delay -clock ppi_tx_ByteClkHS  -max 2  [get_ports ppi_tx_ValidHS_1]
set_output_delay -clock ppi_tx_ByteClkHS  -max 2  [get_ports ppi_tx_ValidHS_2]
set_output_delay -clock ppi_tx_ByteClkHS  -max 2  [get_ports ppi_tx_ValidHS_3]
set_output_delay -clock ppi_tx_ByteClkHS  -max 2  [get_ports {ppi_tx_RequestHS[3]}]
set_output_delay -clock ppi_tx_ByteClkHS  -max 2  [get_ports {ppi_tx_RequestHS[2]}]
set_output_delay -clock ppi_tx_ByteClkHS  -max 2  [get_ports {ppi_tx_RequestHS[1]}]
set_output_delay -clock ppi_tx_ByteClkHS  -max 2  [get_ports {ppi_tx_RequestHS[0]}]
set_output_delay -clock sys_clk  -max 0.5  [get_ports ppi_tx_ClkRequestHS]
set_output_delay -clock sys_clk  -max 0.5  [get_ports {tx_lane0_data_out[7]}]
set_output_delay -clock sys_clk  -max 0.5  [get_ports {tx_lane0_data_out[6]}]
set_output_delay -clock sys_clk  -max 0.5  [get_ports {tx_lane0_data_out[5]}]
set_output_delay -clock sys_clk  -max 0.5  [get_ports {tx_lane0_data_out[4]}]
set_output_delay -clock sys_clk  -max 0.5  [get_ports {tx_lane0_data_out[3]}]
set_output_delay -clock sys_clk  -max 0.5  [get_ports {tx_lane0_data_out[2]}]
set_output_delay -clock sys_clk  -max 0.5  [get_ports {tx_lane0_data_out[1]}]
set_output_delay -clock sys_clk  -max 0.5  [get_ports {tx_lane0_data_out[0]}]
set_output_delay -clock sys_clk  -max 0.5  [get_ports {tx_lane1_data_out[7]}]
set_output_delay -clock sys_clk  -max 0.5  [get_ports {tx_lane1_data_out[6]}]
set_output_delay -clock sys_clk  -max 0.5  [get_ports {tx_lane1_data_out[5]}]
set_output_delay -clock sys_clk  -max 0.5  [get_ports {tx_lane1_data_out[4]}]
set_output_delay -clock sys_clk  -max 0.5  [get_ports {tx_lane1_data_out[3]}]
set_output_delay -clock sys_clk  -max 0.5  [get_ports {tx_lane1_data_out[2]}]
set_output_delay -clock sys_clk  -max 0.5  [get_ports {tx_lane1_data_out[1]}]
set_output_delay -clock sys_clk  -max 0.5  [get_ports {tx_lane1_data_out[0]}]
set_output_delay -clock sys_clk  -max 0.5  [get_ports {tx_lane2_data_out[7]}]
set_output_delay -clock sys_clk  -max 0.5  [get_ports {tx_lane2_data_out[6]}]
set_output_delay -clock sys_clk  -max 0.5  [get_ports {tx_lane2_data_out[5]}]
set_output_delay -clock sys_clk  -max 0.5  [get_ports {tx_lane2_data_out[4]}]
set_output_delay -clock sys_clk  -max 0.5  [get_ports {tx_lane2_data_out[3]}]
set_output_delay -clock sys_clk  -max 0.5  [get_ports {tx_lane2_data_out[2]}]
set_output_delay -clock sys_clk  -max 0.5  [get_ports {tx_lane2_data_out[1]}]
set_output_delay -clock sys_clk  -max 0.5  [get_ports {tx_lane2_data_out[0]}]
set_output_delay -clock sys_clk  -max 0.5  [get_ports {tx_lane3_data_out[7]}]
set_output_delay -clock sys_clk  -max 0.5  [get_ports {tx_lane3_data_out[6]}]
set_output_delay -clock sys_clk  -max 0.5  [get_ports {tx_lane3_data_out[5]}]
set_output_delay -clock sys_clk  -max 0.5  [get_ports {tx_lane3_data_out[4]}]
set_output_delay -clock sys_clk  -max 0.5  [get_ports {tx_lane3_data_out[3]}]
set_output_delay -clock sys_clk  -max 0.5  [get_ports {tx_lane3_data_out[2]}]
set_output_delay -clock sys_clk  -max 0.5  [get_ports {tx_lane3_data_out[1]}]
set_output_delay -clock sys_clk  -max 0.5  [get_ports {tx_lane3_data_out[0]}]
set_output_delay -clock sys_clk  -max 0.5  [get_ports tx_lane0_vld_out]
set_output_delay -clock sys_clk  -max 0.5  [get_ports tx_lane1_vld_out]
set_output_delay -clock sys_clk  -max 0.5  [get_ports tx_lane2_vld_out]
set_output_delay -clock sys_clk  -max 0.5  [get_ports tx_lane3_vld_out]
set_output_delay -clock sys_clk  -max 0.5  [get_ports tx_req_hs_out]
set_clock_groups  -asynchronous -name pixel_clk_1  -group [get_clocks          \
pixel_clk] -group [list [get_clocks sys_clk] [get_clocks byte_clk]] -group     \
[get_clocks ppi_tx_ByteClkHS] -group [get_clocks pclk]
set_false_path   -from [list [get_ports sys_rst_n] [get_ports preset_n] [get_ports             \
pixel_rst_n] [get_ports byte_rst_n]]
set_false_path   -from [list [get_ports {cfg_active_lanes[2]}] [get_ports                      \
{cfg_active_lanes[1]}] [get_ports {cfg_active_lanes[0]}] [get_ports            \
{cfg_frame_lines[15]}] [get_ports {cfg_frame_lines[14]}] [get_ports            \
{cfg_frame_lines[13]}] [get_ports {cfg_frame_lines[12]}] [get_ports            \
{cfg_frame_lines[11]}] [get_ports {cfg_frame_lines[10]}] [get_ports            \
{cfg_frame_lines[9]}] [get_ports {cfg_frame_lines[8]}] [get_ports              \
{cfg_frame_lines[7]}] [get_ports {cfg_frame_lines[6]}] [get_ports              \
{cfg_frame_lines[5]}] [get_ports {cfg_frame_lines[4]}] [get_ports              \
{cfg_frame_lines[3]}] [get_ports {cfg_frame_lines[2]}] [get_ports              \
{cfg_frame_lines[1]}] [get_ports {cfg_frame_lines[0]}]]
